---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
source: html/c5662682-a770-6c2a-fa33-285575ffc291.htm
---
# AnalysisDisplayDiagramSettings Methods

Compares two diagram settings objects.